NSCameraUsageDescription = "Hujjatlarni skanerlash va foto va video yaratish uchun kameraga kirish talab qilinadi.";
NSFaceIDUsageDescription = "Yuzni tanishdan foydalangan holda autentifikatsiya qilish uchun Face ID talab qilinadi.";
NSLocationAlwaysUsageDescription = "Ilova hududlar oʻrtasida harakatlanayotganda fayl yuklanishini avtomatik ishga tushirish uchun joylashuvingizdan foydalanadi.";
NSPhotoLibraryUsageDescription = "Rasm va videolaringizni bulutga yuklash uchun foto kutubxonasiga kirish talab qilinadi.";
NSPhotoLibraryAddUsageDescription = "Rasm va videolaringizni bulutga yuklash uchun foto kutubxonasiga kirish talab qilinadi.";
NSMicrophoneUsageDescription = "Ovozli qaydlarni yaratish uchun mikrofonga kirish talab qilinadi.";
NSLocationWhenInUseUsageDescription = "Bu ilova harakatni aniqlash va fayllarni avtomatik yuklash uchun joylashuvingizdan foydalanadi. U GPSdan foydalanmaydi va joylashuvingizni saqlamaydi.";
NSLocationAlwaysAndWhenInUseUsageDescription = "Muhim harakat aniqlanganda fayllarni avtomatik yuklashni boshlash uchun bu ilova fonda ham joylashuvingizga ruxsat berishi kerak. GPS ishlatilmaydi.";
